Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: As you progress further, you will discover lots of awesome features and hopefully have a great time playing — for example, our new Tower gameplay that rewards you with Gold, Energy and much more!
pt_pt: À medida que avanças, vais descobrir muitos elementos incríveis e esperamos que te divirtas à grande, por exemplo, no novo modo Torre que te dá Ouro, Energia e muitas mais recompensas!

source: BATTLE IN PVP MODES!
pt_pt: JOGA OS MODOS PVP!

source: THAT’S ALL YOU CAN DO?
pt_pt: NÃO CONSEGUES FAZER MELHOR?

source: Privacy policy
pt_pt: Política de Privacidade

source: Winter adventures in the Dominion await! Make sure to care for your Magic Tree with your friends; the taller it is, the more prizes you will all receive. And don't forget to have some fun fighting the Archdemon! Show your might and get lots of rewards—it's a great chance to joyfully power up your teams!
pt_pt: As aventuras de inverno do Domínio aguardam-te! Certifica-te de que cuidas da tua Árvore Mágica; quanto mais alta for, mais prémios irás ganhar. E não te esqueças de te divertir a lutar contra o Grão-Demónio! Mostra o teu poder e obtém montes de recompensa. É uma excelente oportunidade de te divertires a melhorar com as tuas equipas!

source: Your Heroes are getting stronger!
pt_pt: Os heróis estão a ficar mais fortes!

source: Get some luminous outfits for your favorite Guardians and try out a revamped Heidi!
pt_pt: Obtém fatos luminosos para os teus Guardiões e experimenta um Heidi Transformado!

source: Level 3
pt_pt: Nível 3

source: Wintry Wonders!
pt_pt: Maravilhas de Inverno!

source: The Lost Hero!
pt_pt: O Herói Perdido!

source: The Dominion is celebrating Easter!
pt_pt: O Domínio está a celebrar a Páscoa!

source: Let the Egg Hunt begin!
pt_pt: Abriu a caça aos ovos!

source: Power up your Heroes and get a Skin+ for Astaroth!
pt_pt: Melhora heróis e ganha um Visual+ para Astaroth!

source: Guild War!
pt_pt: Guerra de Guildas!

source: MAKE YOUR CHOICE
pt_pt: ESCOLHE

source: Hey there!
pt_pt: Olá!

source: To complete this quest, you need to press the buttons that would give equal numbers on both sides of the door :) Good luck!
pt_pt: Para concluíres esta missão, tens de premir os botões de forma a obter números iguais nos dois lados da porta :) Boa sorte!

source: Glorious Light
pt_pt: Luz Gloriosa

source: Error
pt_pt: Erro

source: The game progress is linked to your App Store account.
pt_pt: O progresso do jogo está ligado à tua conta da App Store.

source: Accept
pt_pt: Aceitar

source: Time for adventures!
pt_pt: Hora da aventura!

source: New Hero A new star rises in the sky of Dominion!
pt_pt: Novo Herói Há uma nova estrela no firmamento do Domínio!

source: Meet Tempus, the Lord of Time, ever-merging the past, present, and future into a blinding kaleidoscope and turning his enemies into puppets.
pt_pt: Dá as boas-vindas a Tempus, Senhor do Tempo, que funde o presente, o passado e o futuro num caleidoscópio alucinante e transforma os seus inimigos em marionetas!

source: He’ll take you with him for an adventure full of dangers, revelations, and paradoxes!
pt_pt: Junta-te a ele numa aventura cheia de perigos, segredos e paradoxos!

source: Talisman Power Don’t miss out the chance to get new Talismans for Cascade, Elmir, Judge, Kai, Keira, and Sebastian!
pt_pt: Poder dos Talismãs Não percas os novos talismãs para Cascade, Elmir, Judge, Kai, Keira e Sebastian!

source: These artifacts will power your Heroes up, making them ready for any challenge!
pt_pt: Estes artefactos poderosos vão deixar os teus heróis prontos para tudo!

source: You received this letter because you have a Throne Rush account connected to the e-mail.
pt_pt: Recebeste esta carta porque tens uma conta Throne Rush associada ao e-mail.

source: Defeat enemies and earn useful resources all month long with the new Pass!
pt_pt: Derrota inimigos e ganha recursos úteis durante todo o mês com o novo Passe!

source: UPGRADE YOUR LEGENDS!
pt_pt: MELHORA AS TUAS LENDAS!

source: Don’t miss the opportunity to upgrade this fantastic Honor Hero!
pt_pt: Não percas a oportunidade de melhorar este fantástico Herói de Honra!

source: • Engage in epic battles against your fellow players in the PvP arena
pt_pt: • Envolver-te em batalhas épicas contra outros jogadores na arena PvP

source: Check out the new Way of Eternity event!
pt_pt: Não percas o novo evento Caminho da Eternidade!

source: Power up your Guardians, upgrade their artifacts, and earn resources!
pt_pt: Melhora os teus Guardiões, os seus artefactos e ganha recursos!

source: RAT HIM OUT
pt_pt: DENUNCIA-O

source: Exchange event coins for a Brawl Chest and unlock Primordial Skins for Titans and Super Titans!
pt_pt: Troca moedas de evento por um Baú de Brigas e desbloqueia Visuais Primordiais para Titãs e Supertitãs!

source: · Cooldown at the Grand Arena reduced from 10 to 1 minute
pt_pt: · O tempo de recuperação na Grande Arena foi reduzido de 10 a 1 minuto

source: Incorrect password
pt_pt: Palavra-passe incorreta

source: Beach Skin Sale!
pt_pt: Promoção de Visuais de Praia!

source: The new Hero, Folio, is coming to Dominion!
pt_pt: Folio, o novo herói, chegou ao Domínio!

source: Explore Dominion with Lara Croft!
pt_pt: Explora o Domínio com Lara Croft!

source: The Parade of Progress!
pt_pt: O Desfile do Progresso!

source: • Build an army of epic heroes, unlock their unique skills, and decimate your enemies
pt_pt: • Criar um exército de heróis épicos, desbloquear as tuas habilidades únicas e dizimar os teus inimigos

source: The annual Autumn Festival is finally here, grab a Harunian Brew, get lots of gold in rewards and celebrate with us!
pt_pt: Já chegou o Festival de Outono anual, pega numa Bebida de Harun, obtém montes de ouro em recompensas e vem celebrar!

source: Join the adventure in the Hero Wars fantasy battle RPG!
pt_pt: Junta-te à aventura no RPG de batalhas de fantasia Hero Wars!

source: Experience rich, strategic gameplay.
pt_pt: Experimenta uma jogabilidade completa e estratégica.

source: In Hero Wars, you can:
pt_pt: Em Hero Wars, vais poder:

source: Unleash
pt_pt: Liberta

source: Titan Brawls!
pt_pt: Brigas de Titãs!

source: Get heaps of resources to upgrade Class Runes!
pt_pt: Obtém muitos recursos e melhora Runas de Classe!

source: Class Runes let you upgrade a specific skill for all Heroes of the same Class.
pt_pt: As Runas de Classe permitem-te melhorar uma habilidade específica para todos os Heróis ao mesmo tempo.

source: A power-up like that can turn the tide in a battle, so don't miss your chance to stock up on upgrade resources for these invaluable runes.
pt_pt: Um reforço assim pode virar a maré da batalha, por isso, não percas a tua oportunidade de acumular recursos de melhoria para estas valiosas runas.

source: Defeat your enemies, obtain rewards, and upgrade your Class Runes!
pt_pt: Derrota os inimigos, obtém recompensas e melhora Runas de Classe!

source: The Dominion blossoms with vibrant colors!
pt_pt: O Domínio está cheio de cores vivas!

source: Spring Outfits You can’t just carry on wearing old clothes after the seasons change!
pt_pt: Visuais primaveris Muda-se a estação, mudam-se as vestes!

source: Corvus, Morrigan, and Dante know that, so they’ve got themselves some new chic Spring Skins!
pt_pt: Corvus, Morrigan e Dante sabem bem disso, por isso arranjaram umas roupas de primavera espetaculares!

source: Out with the cold, and in with the new!
pt_pt: Adeus frio, está na hora de acolher o calor!

source: Fantasy RPG Battles: collect heroes, dominate the arena, be a legend in idle wars!
pt_pt: Lutas de Fantasia RPG: obtém heróis e domina a arena em guerras ociosas!

source: It seems goblins smashed the server
pt_pt: Parece que o servidor foi destruído por duendes

source: It's Dominion Day!
pt_pt: É dia do Domínio!

source: Log into the game daily and spend this April upgrading the Way of Nature mage!
pt_pt: Inicia sessão diariamente em abril para melhorar o mago do Caminho da Natureza!

source: Celebrate the Dominion Day!
pt_pt: Celebra o Dia do Domínio!

source: Hark, brave heroes — an update!
pt_pt: Saudações, bravos heróis — eis uma atualização!

source: Ghost Bridge A second bridge has been temporarily added to guild competitions.
pt_pt: Ponte Fantasma Foi temporariamente adicionada uma segunda ponte às competições de guildas.

source: Capture three enemy structures to flank your enemy!
pt_pt: Captura três estruturas inimigas para flanquear o inimigo!

source: Adventure: Engineering Power A sandstorm is imminent in the Dominion.
pt_pt: Aventura: Poder da Engenharia Está a chegar uma tempestade de areia ao Domínio.

source: Gather the best Engineers and lift the curse that is transforming their homeland into a lifeless desert!
pt_pt: Reúne os melhores Engenheiros para quebrar a maldição que está a transformar o seu mundo num deserto!

source: Turn up the heat in these time-limited events!
pt_pt: Prepara-te para momentos escaldantes nestes eventos por tempo limitado!

source: Learn about Aurora's past!
pt_pt: Descobre o passado de Aurora!

source: Defeat enemies in the dungeon, find treasures—and see how peaceful the Dominion was before.
pt_pt: Derrota inimigos na masmorra, encontra tesouros e vê quão pacífico era o Domínio antes.

source: Be a Hero
pt_pt: Em frente

source: The game progress is linked to your Google Play account.
pt_pt: O progresso do jogo está ligado à tua conta do Google Play.

source: User with such e-mail does not exist. Check the field or #Sign Up#
pt_pt: Não existe um utilizador com este e-mail. Verifica o campo ou #Regista-te#

source: Passwords do not match
pt_pt: As palavras-passe não coincidem

source: Orion, K'arkh, and Keira all wear new outfits this spring!
pt_pt: Orion, K'arkh e Keira têm novos visuais primaveris!

source: And Orion's skin can be upgraded during the new event!
pt_pt: Além disso, podes melhorar o visual de Orion durante o novo evento!

source: Hello! We completely understand how important such resources are. We'll be sure to pass your feedback onto the dev team! By the way, don't forget about the Shed — it can get you almost anything you need ;) Good luck!
pt_pt: Olá! Compreendemos totalmente como os recursos são importantes. Vamos passar os teus comentários para a equipa de desenvolvimento! Já agora, não te esqueças de explorar o Barracão, pois há a grande possibilidade de lá encontrares o que necessitas. Boa sorte!

source: You can not unlink social account which you are currently signed in with.
pt_pt: Não podes desassociar a conta social à qual estás atualmente ligado(a).

source: To unlink this social account, please relogin using different social account, or by using your login & password.
pt_pt: Para desassociar esta conta social, volta a iniciar sessão com uma conta social diferente ou utilizando o teu início de sessão e palavra-passe.

source: SLAY EPIC BOSSES!
pt_pt: ELIMINA BOSSES ÉPICOS!

source: MEET A NEW LEGEND
pt_pt: CONHECE UMA NOVA LENDA

source: Make your Guardians stronger with new Solar updates and get a Skin+ for Kayla!
pt_pt: Melhorias das Profundezas Sombrias e um Visual+ para Kayla!

source: By the way, we have a great fan group: facebook.com/groups/island.questaway Other players are always happy to help and share their tips!
pt_pt: Já agora, temos um excelente grupo de fãs: facebook.com/groups/island.questaway Os outros jogadores estão sempre disponíveis para ajudar!

source: The currency use for in-game prices is determined by your location.
pt_pt: A utilização de moeda para os preços do jogo é determinada pela tua localização.

source: You can change this currency.
pt_pt: Podes alterar esta moeda.

source: • Earn rewards and get rare items, level up your gameplay, and work towards becoming a legendary hero
pt_pt: • Ganhar recompensas e obter itens raros, subir de nível o teu jogo e tentar tornar-te um herói lendário

source: A Battle Pass is your golden ticket to lots of useful resources, a unique avatar, and a cool frame!
pt_pt: O Passe de Batalha é o teu bilhete dourado para recursos úteis, um avatar único e uma moldura porreira!

source: The Full Moon is shining upon the Heroes, granting them incredible power!
pt_pt: A Lua Cheia derrama a sua luz nos teus heróis e enche-os de poder!

source: Don’t miss out a 60% discount during the Google Full Moon 2024 event!
pt_pt: Não percas o desconto de 60% durante o evento Google Full Moon 2024!

source: There are tons of valuable resources for sale, including Julius’s Soul Stones, Artifacts, Runestones, Skin Stones, Chaos Cores, Huge Experience Potions, and Mastery Crystals.
pt_pt: Há montes de descontos em recursos valiosos, como as pedras anímicas de Julius, artefactos, pedras rúnicas, pedras de visual, núcleos caóticos, poções de experiência imensas e cristais de mestria.

source: Make use of the unique offers to power up your Guardians and defeat your enemies with ease!
pt_pt: Estas ofertas únicas vão ajudar-te a melhorar os teus heróis e a derrotar os teus inimigos!

source: The Ancient Titans
pt_pt: Os Titãs Ancestrais

source: Grow the Way of Nature Guardian’s power!
pt_pt: Melhora os poderes desta Guardiã da natureza!

source: The Shrooms need new homes!
pt_pt: Os Mélios precisam de novos lares!

source: Help them by completing various quests, collecting Magic Dew, and growing the Magic Tree with your friends.
pt_pt: Ajuda-os a concluir várias missões, recolhendo Orvalho Mágico e fazendo crescer a Árvore Mágica com os teus amigos.

source: You will definitely be handsomely rewarded!
pt_pt: Irás ser devidamente recompensado!

source: You'll be competing with the other guilds, because a taller tree means more prizes for you and your comrades.
pt_pt: Compete com outras guildas, pois uma árvore mais alta significa mais prémios para ti e os teus companheiros!

source: And don't forget to power-up Mushy and Shroom in the event shop!
pt_pt: E não te esqueças de reforçar Cogu e Mélio na loja do evento!

source: Get Help
pt_pt: Obter ajuda

source: Take part in this three-day event and earn Stellar Skins for Cascade and Ginger!
pt_pt: Participa neste evento e obtém visuais estelares para Cascade e Ginger!

source: With these new skins, the Guardians of Dominion will go from mortal warriors of light and goodness to true celestials!
pt_pt: Com estes novos visuais, os Guardiões do Domínio passarão de guerreiros mortais da luz e bondade a verdadeiros seres celestiais!

source: Dress Lars and Krista up in costumes featuring wonderful little wings, and complete the event quests to earn more Coins and upgrade Krista’s Skin at the special shop!
pt_pt: Veste Lars e Krista com fatos com pequenas asas maravilhosas e conclui as missões do evento para ganhar mais Moedas e melhorar o visual de Krista na loja especial!

source: Thank you for reaching out to us!
pt_pt: Obrigado por nos contactares!

source: There are so many cool features in our game, and we just can't show them all in an ad.
pt_pt: O nosso jogo tem muitas caraterísticas interessantes, impossíveis de apresentar num anúncio.

source: This is why its main goal is to draw your attention to the game so that you could check it out yourself.
pt_pt: É por isso que o principal objetivo é captar a tua atenção para que possas avaliar o jogo por ti mesmo.

source: We sincerely hope that you will have a nice time playing Hero Wars!
pt_pt: Esperamos que te divirtas a jogar o Hero Wars!

source: Have you evolved your Supertitans to the max?
pt_pt: Já levaste os teus Supertitãs ao máximo?

source: Now, when summoning more Titans, you have a chance to get 2,500 Titan Soul Coins!
pt_pt: Agora, quando invocares mais Titãs podes vir a obter 2500 Moedas de Alma de Titã!

source: YOU WIN
pt_pt: GANHASTE

source: Thank you for the detailed feedback.
pt_pt: Obrigado pelos teus comentários detalhados.

source: We'll make sure to take it into account.
pt_pt: Iremos tomá-los em consideração.

source: Please contact our support team and tell us what you think of the game (use the link below and fill out a form: http://bit.ly/HWSupportRU).
pt_pt: Contacta a nossa equipa de suporte e diz-nos o que achas do jogo (usa a ligação abaixo e preenche um formulário: http://bit.ly/HWSupportRU).

source: Your feedback helps us make the game better!
pt_pt: Os teus comentários ajudam-nos a tornar o jogo cada vez melhor!

source: Talisman Keepers!
pt_pt: Guardiões dos Talismãs!

source: Rule your squad!
pt_pt: Comanda um esquadrão!

source: Behold the celestial gifts of Dominion!
pt_pt: Presentes Celestiais no Domínio!

source: New Angelic Skins White wings are back in style!
pt_pt: Novos Visuais Angélicos As asas brancas estão de volta!

source: Check out these ethereal outfits for Mushy and Shroom, Lars, and Krista.
pt_pt: Não percas estes visuais etéreos para Mushy e Shroom, Lars e Krista.

source: Complete event quests and unlock Krista's Super Skin!
pt_pt: Conclui missões de eventos e desbloqueia o Visual+ de Krista!

source: Let the light envelop you!
pt_pt: Que a luz te guie!

source: Luck be with you in battle, Brave Hero!
pt_pt: Boa sorte em combate, bravo herói!

source: And remember—we are always here for you at support@herowars.zendesk.com
pt_pt: Lembra-te: estaremos sempre aqui para te apoiar em support@herowars.zendesk.com

source: Grab the Cybernetic Skins and a special outfit for Yasmine, and use the items on offer to upgrade your Guardians!
pt_pt: Não percas os visuais Cibernéticos e um visual especial para Yasmine. Usa os itens para melhorar os teus Guardiões!

source: Join the competition with your guild and leave everyone in the dust!
pt_pt: Junta-te à competição com a tua guilda! e deixa toda a gente para trás!

source: New password
pt_pt: Palavra-passe nova

source: Ishmael is a crafty fighter, battling both the enemy and his own self!
pt_pt: Ishmael enfrenta tanto os inimigos dele como a sua própria natureza!

source: Earn Soul Stones for him all month long!
pt_pt: Aproveita o mês e ganha Pedras Anímicas!

source: To get those, look for the orders with the tool icon on the orders board
pt_pt: Para as receberes, verifica as encomendas no ícone da ferramenta na tabela das encomendas

source: By signing up, you agree to our
pt_pt: Ao efetuares o registo, concordas com os nossos

source: GET GOLD!
pt_pt: OBTÉM OURO!

source: Try out Folio in all-out brawls and get your hands on valuable resources!
pt_pt: Experimenta Folio em grandes lutas e obtém recursos valiosos!

source: Come grab your 10 Honorable Guardian Boxes + 150 Energy + lots of Gold!
pt_pt: Recolhe 10 Urnas do Honrado Guardião + 150 de Energia + imenso Ouro!

source: Play Hero Wars and battle it out to become the greatest hero!
pt_pt: Joga Hero Wars e luta para te tornares no melhor herói!

source: Make your Guardians stronger with new Dark Depths updates and get a Skin+ for Alvanor!
pt_pt: Melhorias das Profundezas Sombrias e um Visual+ para Alvanor!

source: Reach for the stars!
pt_pt: O céu é o limite!

source: Talismans Phenomenal talismans formed from the energy of the cosmos itself have appeared in the Dominion, but only the select few can channel their staggering power!
pt_pt: Talismãs Talismãs fenomenais formados com a energia do cosmos apareceram no Domínio, mas apenas alguns podem canalizar o seu incrível poder!

source: Talisman Keepers During the celebration, these cosmic talismans will be available to Aurora, Astaroth, Faceless, Galahad, Maya, and Nebula.
pt_pt: Vigias dos Talismãs Durante a celebração, estes talismãs cósmicos estarão disponíveis para Aurora, Astaroth, Sem Rosto, Galahad, Maya e Nebula.

source: Help the chosen Heroes harness their profound power and pick the stats you want to improve!
pt_pt: Ajuda os Heróis escolhidos a aproveitar o seu grande poder e escolhe os atributos que queres melhorar!

source: The power of the cosmos is now in your grasp!
pt_pt: O poder do cosmos está agora ao teu alcance!

source: A tidal wave has crashed down over the Dominion, and only the bold will dare to brave the elements!
pt_pt: Uma onda gigante abateu-se sobre o Domínio e só os mais fortes conseguirão enfrentar os elementos!

source: Don't miss out on this chance to get the new Dark Depths Skins for Alvanor, Tristan, and Andvari!
pt_pt: Não percas os novos visuais das Profundezas Sombrias para Alvanor, Tristan e Andvari!

source: Complete quests and earn event-specific coins and chests to stock up on useful resources and power up your team.
pt_pt: Conclui missões e ganha moedas do evento e baús com recursos para melhorares a tua equipa.

source: This is the perfect opportunity to both dress up your Heroes and obtain special powers!
pt_pt: É a oportunidade perfeita para vestires os teus heróis a preceito e ganhares poderes especiais!

source: New looks are already in the Dominion!
pt_pt: Há novos visuais no Domínio!

source: All his life, Soleil doubted himself, but never gave up the hope of growing strong enough to conquer challenges that once seemed unattainable.
pt_pt: Toda a vida Soleil duvidou de si mesmo, mas nunca perdeu a esperança de ficar suficientemente forte para superar desafios difíceis.

source: Now he has joined the glorious ranks of the Guardians of Dominion!
pt_pt: Agora, juntou-se às gloriosas fileiras dos Guardiões do Domínio!

source: What finally let him test his mettle and rise, shoulder to shoulder with these heroes in defense of the realm?
pt_pt: O que é que lhe permitiu provar o seu valor para poder estar junto dos heróis e defender o reino?

source: Journey into Soleil’s memories and discover his story!
pt_pt: Percorre as memórias de Soleil e descobre a sua história!

source: Dozens of exciting, dangerous levels with countless foes and mighty bosses await.
pt_pt: Aguardam-te dezenas de níveis emocionantes com inúmeros inimigos e bosses poderosos.

source: Help a simple priest become a true hero!
pt_pt: Ajuda um simples padre a tornar-se num verdadeiro herói!

source: Join the event and earn divine new looks for these heroes!
pt_pt: Ganha visuais divinos para estes heróis no evento!

source: Krista’s skin can also be upgraded further at a special shop!
pt_pt: O visual de Krista pode ser melhorado numa loja especial!

source: Tactical Combat
pt_pt: Rápido e tático

source: TAP and take it until you make it!
pt_pt: TOCA até ficares com tudo!

source: Collect Magic Dew to grow the Tree with your friends! The higher the Tree, the more rewards you'll get!
pt_pt: Recolhe Orvalho Mágico e ajuda os teus amigos a criar a Árvore! Quanto mais alta a Árvore, mais recompensas recebes!

source: Spend April upgrading this Nature Mage!
pt_pt: No mês de abril, melhora este Mago da Natureza!

source: Here you need to tap on one of the three statues to continue.
pt_pt: Aqui tens de tocar numa das três estátuas para continuar.

source: If you pick the wrong statue, don't worry — you can try again :) Once the fire changes its color three times, you'll be able to complete this part.
pt_pt: Se escolheres a estátua errada, não te preocupes, porque podes voltar a tentar :) Quando o fogo mudar de cor três vezes, poderás terminar esta parte.

source: Play the game every day and get Soul Stones for the fearless Aurora!
pt_pt: Joga todos os dias e obtém Pedras Anímicas para a destemida Aurora!

source: Charge her crystal blade with destructive might!
pt_pt: Imbui a espada de cristal dela com poder destruidor!

source: Spring Festivities
pt_pt: Festejos Primaveris

source: + BONUS!
pt_pt: +BÓNUS!

source: Daily GIFTS in our newsletter!
pt_pt: PRESENTES diários na nossa newsletter!

source: The Magic Tree is back!
pt_pt: A Árvore Mágica está de volta!

source: Join Soleil in his path to becoming a Guardian!
pt_pt: Junta-te a Soleil enquanto se torna um Guardião!

source: It takes great strength to defeat mighty foes, level up and build your power in Hero Wars
pt_pt: Derrota inimigos, sobe de nível e aumenta o teu poder em Hero Wars
